АлогистикТест2/src/Catalogs/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомера</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Продан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизмУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Несортированный</name>
      <description>Несортированный</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
  </predefined>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/СерийныеНомера/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Владелец) И 
		НЕ Объект.Владелец.ИспользоватьСерийныеНомера Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для номенклатуры не ведется учет по серийным номерам!
		|Установите флаг ""Использовать серийные номера"" в карточке номенклатуры'");
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "СтраницаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаЗаполнить.Видимость	= Ложь;
		//Элементы.ГруппаПродан.Видимость	= Истина;
	Иначе
		Элементы.ГруппаЗаполнить.Видимость = Истина;
		//Элементы.ГруппаПродан.Видимость	= Ложь;
	КонецЕсли;
	
	Если Объект.Продан Тогда
		ДанныеГарантии = Справочники.СерийныеНомера.СрокДействияГарантии(Объект.Ссылка, ТекущаяДата());
		Если ДанныеГарантии.Количество()>0 Тогда
			ПродажаИнфо = ?(ДанныеГарантии.Гарантия, 
			Строка(ДанныеГарантии.ДокументПродажи)+", гарантийный срок до "+ДанныеГарантии.СрокДействияГарантии,
			Строка(ДанныеГарантии.ДокументПродажи));
			ДокументПродажи = ДанныеГарантии.ДокументПродажи;
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.ГруппаRFIDГИСМ.Видимость = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ВидМаркировки")<>Перечисления.ВидыМаркировки.НеМаркируется);
	
	//рфп+
	Если Не Параметры.Ключ.Пустая() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыПакета = Обработки.алк_УправлениеСериями.ВернутьДанныеПоСерийномуНомеру(Объект.Ссылка); //РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(Объект.Ссылка);
		
		Если ПараметрыПакета = Неопределено Тогда
			УстановитьПривилегированныйРежим(Ложь);
			Возврат;  
		КонецЕсли;
		
		Характеристика   = ПараметрыПакета.Характеристика;
		Объем            = ПараметрыПакета.Объем;
		Сертификат 		 = ПараметрыПакета.Сертификат;
		
		Если ЗначениеЗаполнено(Характеристика) Тогда 
			Элементы.Характеристика.Видимость = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объем) Тогда 
			Элементы.Объем.Видимость = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сертификат) Тогда 
			Элементы.Сертификат.Видимость = Истина;
		КонецЕсли;
		
		//Если пилмат
		Если ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001") 
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012")
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000016")    
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017") Тогда
			
			Сухой   = ПараметрыПакета.Сухой; 
			Габарит = ПараметрыПакета.Габарит;
			КоличествоСостав = ПараметрыПакета.КоличествоСостав; 
			ВесНеттоТаможня  = ПараметрыПакета.ВесНеттоТаможня;
			ВесБруттоТаможня = ПараметрыПакета.ВесБруттоТаможня; 
			ПериодУпаковки   = ПараметрыПакета.ПериодУпаковки; 
			КатегорияНоменклатурыПЭО   	= ПараметрыПакета.КатегорияНоменклатурыПЭО; 
			
			Если ЗначениеЗаполнено(Сухой) Тогда 
				Элементы.Сухой.Видимость = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Габарит) Тогда 
				Элементы.Габарит.Видимость = Истина;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ВесНеттоТаможня) Тогда 
				Элементы.ВесНеттоТаможня.Видимость = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВесБруттоТаможня) Тогда 
				Элементы.ВесБруттоТаможня.Видимость = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КатегорияНоменклатурыПЭО) Тогда 
				Элементы.КатегорияНоменклатурыПЭО.Видимость = Истина;
			КонецЕсли;
 		Иначе
			ПериодУпаковки   = ПараметрыПакета.Период; 
		КонецЕсли; 
		//\\
		
		//Если шпон
		Если ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000005")
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.Шпон
			//ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000040") 
			Тогда
			КоличествоСостав = ПараметрыПакета.КоличествоЛистов; //когда шпон или фанера ИД - листы 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПериодУпаковки) Тогда 
			Элементы.КоличествоСостав.Видимость = Истина;
		КонецЕсли;
		
		Если НЕ КоличествоСостав = 0 Тогда 
			Элементы.КоличествоСостав.Видимость = Истина;
		КонецЕсли;
		//\\
		
		Движения.Загрузить(Обработки.алк_УправлениеСериями.ВернутьДвиженияПоПакету(Объект.Ссылка));  
		УстановитьПривилегированныйРежим(Ложь);
		
		//Для Каждого стр ИЗ Движения Цикл
		//	Если СтрНайти(Строка(стр.Регистратор),"<Объект не найден>") > 0 Тогда 
		//		Движения.Удалить(стр);
		//	КонецЕсли;
		//КонецЦикла;
		
		Если Движения.Количество() <> 0 Тогда  
			Элементы.Движения.Видимость = Истина;	
		КонецЕсли;
		

	КонецЕсли;  
	//рфп
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПередЗаписьюНаСервере()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСерийныйНомерНаСервере()
	
	Объект.Наименование = РаботаССерийнымиНомерами.ДобавитьСерийныйНомер(Объект.Владелец, ШаблонСерийногоНомера).НовыйНомер;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСерийныйНомер(Команда)  
	
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда 
		
		Сообщить("Укажите номенклатуру!");
		Возврат;
	
	КонецЕсли;
	
	ДобавитьСерийныйНомерНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажаИнфоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ДокументПродажи) Тогда
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(ДокументПродажи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СокрЛП(Объект.Наименование)="" Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Серийный номер не заполнен!'");
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекДанные = Элементы.Движения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ОткрытьЗначениеАсинх(ТекДанные.Регистратор);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
